In [2]:
import pandas as pd
import numpy as np

In [5]:
sheet_list=['Cover Sheet','Contents','2.2.2','2.2.2 (Real)','2.2.2 (Economy 7)','2.2.2 (Economy 7 Real)','2.2.2 (Financial Year)','2.2.2 (Financial Year E7)','Methodology']

In [6]:
dfs = pd.read_excel(r'C:\Users\Jagatheesh\OneDrive\Desktop\Heriot_Watt_University_Msc_Data_Science\Data_Viz_CW2\Cost_of_living_crisis_UK_Storyboard\Resources\DataSet\Energy.xlsx', sheet_name=sheet_list)

In [7]:
df_list=[dfs[i] for i in sheet_list]

In [8]:
sheet_list

['Cover Sheet',
 'Contents',
 '2.2.2',
 '2.2.2 (Real)',
 '2.2.2 (Economy 7)',
 '2.2.2 (Economy 7 Real)',
 '2.2.2 (Financial Year)',
 '2.2.2 (Financial Year E7)',
 'Methodology']

In [16]:
bills=df_list[3].iloc[10:,-3:]
bills

    Unnamed: 10  Unnamed: 11 Unnamed: 12
10   530.997676   533.254637  464.615593
11   563.865486   567.566168  493.297836
12   600.921867   605.232355  542.292722
13   572.452608   575.848205  532.129148
14   624.865698   623.813857  566.774179
15  1100.699246  1121.380032  781.120522

In [17]:
bills.rename(columns={'Unnamed: 10':'England and Wales','Unnamed: 11':'Scotland','Unnamed: 12':'Ireland'},inplace=True)
bills

   England and Wales     Scotland     Ireland
10        530.997676   533.254637  464.615593
11        563.865486   567.566168  493.297836
12        600.921867   605.232355  542.292722
13        572.452608   575.848205  532.129148
14        624.865698   623.813857  566.774179
15       1100.699246  1121.380032  781.120522

In [18]:
bills.to_csv('avg_energy_bill.csv')

In [23]:
for i in bills.columns:
    print(i+"  :  "+ str(bills[i].mean()))

England and Wales  :  665.6337634912874
Scotland  :  671.1825423822648
Ireland  :  563.3716668531571